Repository: BricePetit/bricepetit.github.io
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: Page Not Found
fr: Page Introuvable

source: Sorry, the page you are looking for doesn't exist or has been moved.
fr: Désolé, la page que vous recherchez n'existe pas ou a été déplacée.

source: Back to Home
fr: Retour à l'Accueil

source: View Skills
fr: Voir les Compétences

source: Where would you like to go?
fr: Où souhaitez-vous aller ?

source: Home Page
fr: Page d'Accueil

source: Skills & Projects
fr: Compétences & Projets

source: Research & Academic
fr: Recherche & Académique

source: Education & Experience
fr: Formation & Expérience

source: What happened?
fr: Que s'est-il passé ?

source: The page URL might be incorrect
fr: L'URL de la page pourrait être incorrecte

source: The page might have been moved or deleted
fr: La page a pu être déplacée ou supprimée

source: You might have followed an outdated link
fr: Vous avez peut-être suivi un lien obsolète

source: There might be a temporary server issue
fr: Il peut y avoir un problème de serveur temporaire

source: If you believe this is an error, please feel free to contact me through the
fr: Si vous pensez qu'il s'agit d'une erreur, n'hésitez pas à

source: contact form
fr: me contacter

source: Academic Profile
fr: Profil Académique

source: Teaching Experience
fr: Expérience d'Enseignement

source: Professional Journey & Academic Background
fr: Parcours Professionnel & Formation Académique

source: Work Experience
fr: Expérience Professionnelle

source: Responsibilities
fr: Responsabilités

source: Achievements
fr: Réalisations

source: Academic Education
fr: Formation Académique

source: Study Areas
fr: Domaines d'Étude

source: Status
fr: Statut

source: Keep in Touch
fr: Restons en Contact

source: All rights reserved.
fr: Tous droits réservés.

source: Skills
fr: Compétences

source: Academic
fr: Académique

source: Education & Work Experience
fr: Formation & Expérience

source: Applied AI Engineer
fr: Ingénieur IA appliquée

source: Applied AI Engineer - Energy Analytics
fr: Ingénieur IA appliquée — Analyse énergétique

source: Contact Me
fr: Contactez-moi

source: View Research
fr: Voir Recherche

source: Years
fr: Années

source: Applied Research & Industry Projects
fr: Recherche Appliquée & Projets Industriels

source: Households
fr: Ménages

source: Energy Data Analyzed
fr: Données Énergétiques Analysées

source: Machine Learning & Forecasting
fr: Machine Learning & Prédiction

source: University
fr: Université

source: IRIDIA Research Lab
fr: Laboratoire de Recherche IRIDIA

source: About My Work
fr: À Propos de Mon Travail

source: I am a Data Scientist and Machine Learning Engineer specializing in artificial intelligence applied to energy systems. I hold a Master’s degree in Computer Science from the Université Libre de Bruxelles, where I focused on artificial intelligence, algorithms, and applied mathematics.
fr: Je suis data scientist et ingénieur en machine learning, spécialisé dans l'application de l'intelligence artificielle aux systèmes énergétiques. Je suis titulaire d'un master en informatique de l'Université Libre de Bruxelles, où je me suis focalisé sur l'intelligence artificielle, les algorithmes et les mathématiques appliquées.

source: I work on a wide range of topics, including deep learning, machine learning, reinforcement learning, and large-scale data processing. Beyond the technical aspects, I am particularly driven by global challenges such as climate change, energy transition, and sustainable resource management.
fr: Je travaille sur un large éventail de sujets, notamment l'apprentissage profond, l'apprentissage automatique, l'apprentissage par renforcement et le traitement de données à grande échelle. Au-delà des aspects techniques, je suis particulièrement motivé par des enjeux mondiaux tels que le changement climatique, la transition énergétique et la gestion durable des ressources.

source: My recent work includes electricity forecasting projects, data-driven optimization, and intelligent decision-support systems. I contributed to Voisins d’Énergie, a co-creation initiative exploring energy flexibility and community-based energy management, for which I designed and deployed a complete data collection and monitoring platform.
fr: Mes travaux récents incluent des projets de prévision électrique, de d'optimisation pilotée par les données et des systèmes d'aide à la décision intelligents. J'ai contribué à Voisins d’Énergie, une initiative de co-création explorant la flexibilité énergétique et la gestion communautaire de l'énergie, pour laquelle j'ai conçu et déployé une plateforme complète de collecte et de monitoring des données.

source: Subsequently, in collaboration with AIEG - a network operator - we explored electricity forecasting (both consumption and production) to address the challenge of ensuring that production does not exceed network losses. Finally, we will investigate the development of an intelligent distribution key for energy sharing.
fr: Par la suite, en collaboration avec AIEG — un opérateur de réseau — nous avons exploré la prévision électrique (consommation et production) afin de répondre au défi de garantir que la production ne dépasse pas les pertes du réseau. Enfin, nous étudierons le développement d'une clé de répartition intelligente pour le partage d'énergie.

source: Research Topics
fr: Sujets de Recherche

source: Artificial Intelligence & Machine Learning
fr: Intelligence Artificielle & Apprentissage Automatique

source: Time Series Forecasting & Prediction
fr: Prédiction & Prévision de Séries Temporelles

source: Big Data Analytics & Processing
fr: Analyse & Traitement de Big Data

source: Energy Sharing & Smart Grids
fr: Partage d'Énergie & Réseaux Intelligents

source: Energy Communities & Sustainability
fr: Communautés Énergétiques & Durabilité

source: Deep Learning & Neural Networks
fr: Apprentissage Profond & Réseaux de Neurones

source: Where to Find Me
fr: Où Me Trouver

source: Office:
fr: Bureau :

source: Technical Expertise & Innovation
fr: Expertise Technique & Innovation

source: Skills Level Scale
fr: Échelle des Niveaux de Compétences

source: Technical skill levels are evaluated based on practical experience and complexity of completed projects:
fr: Les niveaux de compétences techniques sont évalués en fonction de l'expérience pratique et de la complexité des projets réalisés :

source: 5+ years of experience, advanced research projects, innovation and community contribution
fr: 5+ ans d'expérience, projets avancés, innovation et contribution

source: Advanced
fr: Avancé

source: 2-5 years of experience, complex professional projects, deep mastery
fr: 2-5 ans d'expérience, projets complexes, maîtrise approfondie

source: Intermediate
fr: Intermédiaire

source: 1-2 years of experience, academic/personal projects, good understanding
fr: 1-2 ans d'expérience, projets académiques ou personnels, bonne compréhension

source: Beginner
fr: Débutant

source: Less than 1 year, recent learning, basic knowledge
fr: Moins d'1 an, apprentissage récent, connaissances de base

source: Programming Languages
fr: Langages de Programmation

source: ML/DL Frameworks
fr: ML et DL

source: Data Science Tools
fr: Outils Data Science

source: DevOps & Tools
fr: DevOps & Outils

source: Expertise Domains
fr: Domaines d'Expertise

source: Languages
fr: Langues

source: Featured Projects
fr: Projets Principaux

source: Main language for ML and DL, data science and web development
fr: Langage principal pour ML/DL, science des données et développement web

source: Code optimization and climate simulation
fr: Optimisation de code et simulation climatique

source: Object-oriented development and enterprise applications
fr: Développement orienté objet et applications d'entreprise

source: Statistical analysis and data science
fr: Analyse statistique et science des données

source: Legacy code and scientific simulations
fr: Code legacy et simulations scientifiques

source: Deep learning and neural networks
fr: Deep learning et réseaux de neurones

source: Deep learning research and prototyping
fr: Recherche en deep learning et prototypage

source: Classical machine learning and preprocessing
fr: Machine learning classique et preprocessing

source: Gradient boosting for time series and prediction
fr: Gradient boosting pour séries temporelles et prédiction

source: Interactive development and prototyping
fr: Développement interactif et prototypage

source: Data manipulation and analysis
fr: Manipulation et analyse de données

source: Numerical computing and linear algebra
fr: Calcul numérique et algèbre linéaire

source: Static data visualization
fr: Visualisation de données statiques

source: Statistical visualization
fr: Visualisation statistique

source: Interactive visualizations
fr: Visualisations interactives

source: Relational database
fr: Base de données relationnelle

source: NoSQL for big data and IoT
fr: NoSQL pour big data et IoT

source: Containerization and deployment
fr: Conteneurisation et déploiement

source: Version control and collaboration
fr: Contrôle de version et collaboration

source: Configuration management and automation
fr: Gestion de configuration et automatisation

source: Service management and unit configuration on Linux
fr: Gestion des services et configuration des unités sous Linux

source: Scripting and automation
fr: Scripts et automatisation

source: Convolutional Neural Networks for image/sequence modelling
fr: Réseaux convolutionnels pour la modélisation d'images et de séquences

source: Long Short-Term Memory networks for sequential data
fr: Réseaux LSTM pour données séquentielles

source: Attention-based architectures for sequence modelling
fr: Architectures basées sur l'attention pour la modélisation de séquences

source: Supervised Machine Learning
fr: Machine Learning Supervisé

source: Classification, regression, optimization
fr: Classification, régression, optimisation

source: Time Series Analysis
fr: Analyse de Séries Temporelles

source: Time analysis techniques, trend and seasonality detection
fr: Techniques d'analyse temporelle, détection de tendances et saisonnalité

source: Energy Forecasting
fr: Ingénieur de recherche en IA et prévision énergétique

source: Energy consumption and production prediction in business context
fr: Prédiction de consommation et production énergétique en contexte métier

source: Energy Communities
fr: Communautés d'Énergie

source: Distribution keys, community optimization
fr: Clés de répartition, optimisation communautaire

source: Energy Optimization
fr: Optimisation Énergétique

source: Production vs consumption, smart grids
fr: Production vs consommation, réseaux intelligents

source: French
fr: Français

source: Native
fr: Natif

source: Mother tongue
fr: Langue maternelle

source: English
fr: Anglais

source: Professional and academic
fr: Professionnel et académique

source: Dutch
fr: Néerlandais

source: Conversational
fr: Conversationnel

source: Data parser for Renewgy company
fr: Parseur de données pour l'entreprise Renewgy

source: Data Processing
fr: Traitement de Données

source: Data collection via smart meters with Raspberry Pi and Cassandra
fr: Collecte de données via compteurs intelligents avec Raspberry Pi et Cassandra

source: Energy consumption and production prediction
fr: Prédiction de consommation et production énergétique

source: Time Series
fr: Séries Temporelles

source: Web interface for energy communities
fr: Interface web pour communautés d'énergie

source: Web Development
fr: Développement Web

source: Data Visualization
fr: Visualisation de Données

source: Electrical data disaggregation project using AI/ML techniques (discontinued due to funding constraints)
fr: Projet de désagrégation des données électriques utilisant des techniques d'IA/ML (abandonné en raison de contraintes de financement)

source: Signal Processing
fr: Traitement du Signal

source: Voisin d'Énergie Database
fr: Base de données Voisin d'Énergie

source: Cassandra database for the Voisins d'Énergie project
fr: Base de données Cassandra pour le projet Voisins d'Énergie

source: Database Design
fr: Conception de Base de Données

source: Energy Data
fr: Données Énergétiques

source: Conversion of a Fortran climate model to Python and C++ (procedural and object-oriented)
fr: Conversion d'un modèle climatique Fortran vers Python et C++ (procédural et orienté objet)

source: Climate Modeling
fr: Modélisation Climatique

source: Smart Waste Classification
fr: Classification Intelligente de Déchets

source: Smart waste bins with automatic waste classification using AI
fr: Poubelles intelligentes avec classification automatique des déchets par IA

source: Computer Vision
fr: Vision par Ordinateur

source: Expert/Advanced
fr: Expert/Avancé

source: More than 2 years of experience, complex professional projects, deep mastery
fr: Plus de 2 années d'expérience, projets professionnels complexes, maîtrise approfondie

source: Professional and academic level
fr: Niveau professionnel et académique

source: Conversational level
fr: Niveau conversationnel

source: Brice Petit - Skills & Expertise
fr: Brice Petit - Compétences & Expertise

source: Université Libre de Bruxelles - INFO-H402 - Computing project
fr: Université Libre de Bruxelles - INFO-H402 - Projet informatique

source: Project
fr: Projet

source: Brice Petit - Academic Profile
fr: Brice Petit - Profil Académique

source: Welcome to the academic page.
fr: Bienvenue sur la page académique.

source: 2022 - Present
fr: 2022 - Présent

source: 3+ years
fr: 3+ ans

source: Brussels, Belgium
fr: Bruxelles, Belgique

source: Full-time
fr: Temps plein

source: FARI & AIEG Collaboration
fr: Collaboration FARI & AIEG

source: AI and machine learning applied to energy systems
fr: IA et apprentissage automatique appliqués aux systèmes énergétiques

source: Teaching assistant in computer science
fr: Assistant d'enseignement en informatique

source: Development and deployment of machine learning models
fr: Développement et déploiement de modèles de machine learning

source: Student supervision and technical project support
fr: Encadrement d'étudiants et support technique aux projets

source: Development of energy prediction models (XGBoost, CNN, LSTM, Transformer)
fr: Développement de modèles de prévision énergétique (XGBoost, CNN, LSTM, Transformer)

source: Data collection from 100+ households via IoT
fr: Collecte de données auprès de plus de 100 ménages via l'IoT

source: Creation of NoSQL database (Cassandra) for big data
fr: Création d'une base de données NoSQL (Cassandra) pour big data

source: Django web interface for energy data visualization
fr: Interface web Django pour visualisation de données énergétiques

source: 3 years
fr: 3 ans

source: Youth Movement Coordinator
fr: Coordinateur de Mouvement de Jeunesse

source: Youth Movement
fr: Mouvement de Jeunesse

source: Volunteer
fr: Bénévole

source: Social engagement and youth development
fr: Engagement social et développement de la jeunesse

source: Coordination and supervision of youth activities
fr: Coordination et supervision d'activités de jeunesse

source: Event organization and management
fr: Organisation et gestion d'événements

source: Team leadership and volunteer coordination
fr: Leadership d'équipe et coordination de bénévoles

source: Successful organization of camps and activities
fr: Organisation réussie de camps et d'activités

source: Building strong relationships with young people
fr: Construction de relations solides avec les jeunes

source: Strengthening leadership and pedagogical skills
fr: Renforcement des compétences de leadership et pédagogiques

source: 1 year
fr: 1 an

source: Server
fr: Serveur

source: Student job
fr: Job étudiant

source: Customer service in specialized beer bar
fr: Service client dans bar à bières spécialisé

source: Customer service in French, English, Dutch
fr: Service clientèle en français, anglais, néerlandais

source: Craft beer consulting
fr: Conseil en bières artisanales

source: Cash register and order management
fr: Gestion de caisse et commandes

source: Development of language skills
fr: Développement des compétences linguistiques

source: Excellence in customer service
fr: Excellence en service client

source: Stress management in dynamic environment
fr: Gestion du stress en environnement dynamique

source: 4 years
fr: 4 ans

source: Crew Member
fr: Équipier

source: Fast food during studies
fr: Restauration rapide pendant les études

source: Multilingual customer service
fr: Service client multilingue

source: Order preparation
fr: Préparation de commandes

source: Teamwork under pressure
fr: Travail en équipe sous pression

source: Flexibility and adaptation
fr: Flexibilité et adaptation

source: Time management skills
fr: Compétences en gestion du temps

source: Team spirit development
fr: Esprit d'équipe développé

source: Machelen, Belgium
fr: Machelen, Belgique

source: Intellectual property firm
fr: Cabinet de propriété intellectuelle

source: Administrative support
fr: Support administratif

source: Document filing
fr: Classement de documents

source: Team assistance
fr: Assistance aux équipes

source: Introduction to professional world
fr: Introduction au monde professionnel

source: Rigor and organization
fr: Rigueur et organisation

source: First contact with corporate environment
fr: Premiers contacts avec l'environnement corporate

source: 2 years
fr: 2 ans

source: Master in Computer Science
fr: Master en Sciences Informatiques

source: Artificial Intelligence & embedded systems
fr: Intelligence Artificielle & systèmes embarqués

source: Advanced algorithms
fr: Algorithmique avancée

source: Distributed systems
fr: Systèmes distribués

source: AI thesis project
fr: Projet de fin d'études en IA

source: Graduated
fr: Diplômé

source: Bachelor in Computer Science
fr: Bachelier en Sciences Informatiques

source: General Computer Science
fr: Informatique Générale

source: Programming (Java, C++, Python)
fr: Programmation (Java, C++, Python)

source: Applied mathematics
fr: Mathématiques appliquées

source: Data structures and algorithms
fr: Structures de données et algorithmes

source: Databases and systems
fr: Bases de données et systèmes

source: Brice Petit - Education & Experience
fr: Brice Petit - Formation & Expérience

source: Page Not Found - Brice Petit
fr: Page Introuvable - Brice Petit

source: Topics of interest
fr: Sujets d'intérêt

source: Intelligent 8-puzzle solver using advanced search algorithms and reinforcement learning for path optimization
fr: Résolveur de taquin intelligent utilisant des algorithmes de recherche avancés et l'apprentissage par renforcement pour l'optimisation de chemins

source: Search Algorithms
fr: Algorithmes de Recherche

source: Heuristic Optimization
fr: Optimisation Heuristique

source: Research Engineer in Artificial Intelligence
fr: Ingénieur de Recherche en Intelligence Artificielle

source: September 2023 - Present
fr: Septembre 2023 - Présent

source: 1+ years
fr: 1+ ans

source: Building Manager
fr: Syndic de Copropriété

source: Residential Co-ownership Management
fr: Gestion de Copropriété Résidentielle

source: Voluntary role
fr: Bénévole

source: Management of 4-unit residential property
fr: Gestion d'un immeuble résidentiel de 4 appartements

source: Design of predictive models for solar production and consumption to optimise PV investments and support grid balancing (XGBoost, CNN, LSTM, Transformer)
fr: Conception de modèles de prédiction pour la production solaire et la consommation afin d'optimiser les investissements photovoltaïques et maintenir l'équilibre du réseau (XGBoost, CNN, LSTM, Transformer)

source: Built predictive models for photovoltaic production and consumption to inform investment decisions and improve network stability (XGBoost, CNN, LSTM, Transformer)
fr: Conception et déploiement de modèles prédictifs pour la production photovoltaïque et la consommation afin d'éclairer les décisions d'investissement et améliorer la stabilité du réseau (XGBoost, CNN, LSTM, Transformer)

source: Collaborated with Innoviris, AIEG and Renewgy on applied research projects
fr: Collaboration avec Innoviris, AIEG et Renewgy dans le cadre de projets de recherche appliquée

source: Design and deployment of a real-time energy data collection and visualization system for citizen energy communities (Cassandra, Python, Django)
fr: Conception et déploiement d'un système de collecte et de visualisation de données énergétiques en temps réel pour des communautés d'énergie citoyennes (Cassandra, Python, Django)

source: Research and development of non-intrusive load monitoring (NILM) models for electrical disaggregation
fr: Recherche et développement de modèles de désagrégation électrique non intrusifs (NILM)

source: Teaching assistant duties and supervision of student projects (individual and group)
fr: Fonctions d'assistant d'enseignement et encadrement de projets étudiants (individuels et en groupe)

source: Deployed a production-ready real-time data pipeline and visualization stack for community energy projects
fr: Mise en production d'un pipeline de données temps réel et d'une interface de visualisation pour des projets d'énergie communautaire

source: Implemented NILM models for electrical disaggregation and integrated them into the analytics workflow
fr: Implémentation de modèles NILM pour la désagrégation électrique et intégration dans le flux d'analyse

source: Created and maintained a scalable NoSQL data backend (Cassandra) to handle high-frequency energy data
fr: Conception et maintenance d'un backend NoSQL scalable (Cassandra) pour gérer des données énergétiques à haute fréquence

source: Supervised and mentored students on multiple successful research and engineering projects
fr: Supervision et mentorat d'étudiants sur plusieurs projets de recherche et d'ingénierie réussis

source: Building administration and property management
fr: Administration de l'immeuble et gestion immobilière

source: Financial oversight and budget planning
fr: Contrôle financier et planification budgétaire

source: Maintenance coordination and contractor supervision
fr: Coordination de la maintenance et supervision des entrepreneurs

source: Resident communication and conflict resolution
fr: Communication avec les résidents et résolution de conflits

source: Effective financial management and budget control
fr: Gestion financière efficace et contrôle budgétaire

source: Successful coordination of building renovations
fr: Coordination réussie des rénovations de l'immeuble

source: Improved communication among residents
fr: Amélioration de la communication entre résidents

source: Diocesan Youth Service
fr: Service de la Jeunesse Diocésain
